In [1]:
import pandas as pd
import numpy as np

# Загрузка данных

В качестве данных возьмём ежедневную информацию о курсе Центробанка швейцарского франка к рублю за последний год

In [2]:
%%capture
!wget https://www.dropbox.com/scl/fi/arzso038p5612jcd8avay/rc-f01-12-2022-t01-12-2023.csv

In [29]:
data = pd.read_csv("RC_F01_12_2022_T01_12_2023.csv", delimiter = ";")

In [30]:
data

     nominal        data      curs                cdx
0          1  01.12.2023   101,248  Швейцарский франк
1          1  30.11.2023  101,3849  Швейцарский франк
2          1  29.11.2023  100,6934  Швейцарский франк
3          1  28.11.2023   100,629  Швейцарский франк
4          1  25.11.2023  100,4335  Швейцарский франк
..       ...         ...       ...                ...
244        1  07.12.2022   66,6705  Швейцарский франк
245        1  06.12.2022   66,5506  Швейцарский франк
246        1  03.12.2022   66,0482  Швейцарский франк
247        1  02.12.2022   64,7753  Швейцарский франк
248        1  01.12.2022   64,0441  Швейцарский франк

[249 rows x 4 columns]

In [31]:
data = data.drop(columns = ['nominal', 'cdx'])

In [32]:
data.head(7)

         data      curs
0  01.12.2023   101,248
1  30.11.2023  101,3849
2  29.11.2023  100,6934
3  28.11.2023   100,629
4  25.11.2023  100,4335
5  24.11.2023   99,8081
6  23.11.2023   99,6888

In [33]:
data.curs = data.curs.apply(lambda x: x.replace(',', '.'))

In [34]:
data.curs = data.curs.astype(float)

In [35]:
data.head(7)

         data      curs
0  01.12.2023  101.2480
1  30.11.2023  101.3849
2  29.11.2023  100.6934
3  28.11.2023  100.6290
4  25.11.2023  100.4335
5  24.11.2023   99.8081
6  23.11.2023   99.6888

In [36]:
data = data.rename(columns = {'data': 'date', 'curs': 'rate'})

In [39]:
data.date = pd.to_datetime(data.date, format = '%d.%m.%Y')

In [40]:
data.head(7)

        date      rate
0 2023-12-01  101.2480
1 2023-11-30  101.3849
2 2023-11-29  100.6934
3 2023-11-28  100.6290
4 2023-11-25  100.4335
5 2023-11-24   99.8081
6 2023-11-23   99.6888

In [43]:
data = data.sort_values(by = 'date')

In [44]:
data

          date      rate
248 2022-12-01   64.0441
247 2022-12-02   64.7753
246 2022-12-03   66.0482
245 2022-12-06   66.5506
244 2022-12-07   66.6705
..         ...       ...
4   2023-11-25  100.4335
3   2023-11-28  100.6290
2   2023-11-29  100.6934
1   2023-11-30  101.3849
0   2023-12-01  101.2480

[249 rows x 2 columns]